In [1]:
import numpy as np
import pandas as pd

In [2]:
Emp_data = pd.DataFrame({'EmployeeID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Department': ['HR', 'IT', 'Finance', 'IT', 'HR'],
    'Salary': [50000, 60000, 55000, 65000, 58000]})

Display the 'Name' and 'Salary' columns from the Employee_data DataFrame.

In [3]:
Emp_data[["Name","Salary"]]

      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   55000
3    David   65000
4      Eva   58000

In [4]:
Emp_data["Salary"].mean()

57600.0

Find the average salary of employees in the 'IT' department.

In [9]:
IT_dept = Emp_data[Emp_data['Department'] == 'IT']['Salary'].mean()
IT_dept

62500.0

In [10]:
#avg = IT_dept['Salary'].mean()
#avg

IndexError: invalid index to scalar variable.

Add a new column 'Bonus' where the bonus is 10% of the salary.

In [11]:
Emp_data['Bonus']=Emp_data['Salary']*(1/10)
Emp_data

   EmployeeID     Name Department  Salary   Bonus
0         101    Alice         HR   50000  5000.0
1         102      Bob         IT   60000  6000.0
2         103  Charlie    Finance   55000  5500.0
3         104    David         IT   65000  6500.0
4         105      Eva         HR   58000  5800.0

Rename the 'EmployeeID' column to 'ID'.

In [13]:
Emp_data.rename(columns={'EmployeeID':'ID'},inplace=True)
Emp_data

    ID     Name Department  Salary   Bonus
0  101    Alice         HR   50000  5000.0
1  102      Bob         IT   60000  6000.0
2  103  Charlie    Finance   55000  5500.0
3  104    David         IT   65000  6500.0
4  105      Eva         HR   58000  5800.0

Drop the 'Department' column.

In [14]:
Emp_data.drop('Department', axis=1)

    ID     Name  Salary   Bonus
0  101    Alice   50000  5000.0
1  102      Bob   60000  6000.0
2  103  Charlie   55000  5500.0
3  104    David   65000  6500.0
4  105      Eva   58000  5800.0

Create a DataFrame sales_data with the following data:

In [15]:
Sales_data = pd.DataFrame({ 'Month': ['Jan', 'Feb', 'Mar', 'Apr', 'May'],
    'Product_A': [150, 200, 250, 300, 350],
    'Product_B': [300, 250, 200, 150, 100]
})
Sales_data

  Month  Product_A  Product_B
0   Jan        150        300
1   Feb        200        250
2   Mar        250        200
3   Apr        300        150
4   May        350        100

In [16]:
tot_A = Sales_data['Product_A'].sum()
tot_A

1250

In [17]:
tot_B = Sales_data['Product_B'].sum()
tot_B

1000

Calculate the total sales for each product ('Product_A' and 'Product_B') in the sales_data DataFrame.

In [51]:
total1 = tot_A+tot_B
total1

2250

Find the month with the highest sales for Product_A.

In [18]:
max_A = Sales_data['Product_A'].max()
max_A

350

In [19]:
max_month_A = Sales_data['Month'][Sales_data['Product_A'].idxmax()]
max_month_A

'May'

Add a new column 'Total_Sales' which is the sum of 'Product_A' and 'Product_B'.

In [20]:
Sales_data['Total_Sales']=Sales_data['Product_A']+Sales_data['Product_B']
Sales_data

  Month  Product_A  Product_B  Total_Sales
0   Jan        150        300          450
1   Feb        200        250          450
2   Mar        250        200          450
3   Apr        300        150          450
4   May        350        100          450

Normalize the 'Product_A' sales by dividing by the maximum sales.

In [21]:
Normalized_A = Sales_data['Product_A']/max_A
Normalized_A

0    0.428571
1    0.571429
2    0.714286
3    0.857143
4    1.000000
Name: Product_A, dtype: float64

Filter the DataFrame to show only months where total sales exceeded 400.

In [22]:
filtered=Sales_data[Sales_data['Total_Sales']>400]
filtered

  Month  Product_A  Product_B  Total_Sales
0   Jan        150        300          450
1   Feb        200        250          450
2   Mar        250        200          450
3   Apr        300        150          450
4   May        350        100          450

Create a DataFrame customer_data with the following data:

In [23]:
Customer_data = pd.DataFrame({ 'CustomerID': [1, 2, 3, 4, 5],
    'Name': ['John', 'Jane', None, 'Alice', 'Bob'],
    'Purchase': [200, 300, 150, None, 500]
})
Customer_data

   CustomerID   Name  Purchase
0           1   John     200.0
1           2   Jane     300.0
2           3   None     150.0
3           4  Alice       NaN
4           5    Bob     500.0

Identify and count the number of missing values in each column of the customer_data DataFrame.

In [24]:
Customer_data.isnull().sum()

CustomerID    0
Name          1
Purchase      1
dtype: int64

Fill the missing values in the 'Name' column with 'Unknown'.

In [25]:
Customer_data['Name']=Customer_data['Name'].fillna('Unknown')
Customer_data

   CustomerID     Name  Purchase
0           1     John     200.0
1           2     Jane     300.0
2           3  Unknown     150.0
3           4    Alice       NaN
4           5      Bob     500.0

Fill the missing values in the 'Purchase' column with the median of the column.

In [26]:
Customer_data['Purchase']=Customer_data['Purchase'].fillna(Customer_data['Purchase'].median())
Customer_data

   CustomerID     Name  Purchase
0           1     John     200.0
1           2     Jane     300.0
2           3  Unknown     150.0
3           4    Alice     250.0
4           5      Bob     500.0

Drop any rows that still contain missing values.

In [27]:
Customer_data.dropna()

   CustomerID     Name  Purchase
0           1     John     200.0
1           2     Jane     300.0
2           3  Unknown     150.0
3           4    Alice     250.0
4           5      Bob     500.0

Series Operations: Temperature Data

Create a Series temperature with the following data:

In [30]:
temperature = pd.Series([23, 21, 20, 25, 27, 30, 28, 22, 24, 26])
temperature

0    23
1    21
2    20
3    25
4    27
5    30
6    28
7    22
8    24
9    26
dtype: int64

Find the mean, median, and variance

In [32]:
mean_temp = temperature.mean()
median_temp = temperature.median()
variance_temp = temperature.var()

In [33]:
mean_temp

24.6

In [34]:
median_temp

24.5

In [35]:
variance_temp

10.266666666666666

Create a new Series indicating whether each temperature is above or below the mean

In [36]:
above_below_mean = temperature > mean_temp
above_below_mean

0    False
1    False
2    False
3     True
4     True
5     True
6     True
7    False
8    False
9     True
dtype: bool

Convert the temperatures to Kelvin

In [38]:
temperature_kelvin = temperature + 273.15
temperature_kelvin

0    296.15
1    294.15
2    293.15
3    298.15
4    300.15
5    303.15
6    301.15
7    295.15
8    297.15
9    299.15
dtype: float64

 Calculate the rolling mean with a window size of 3

In [39]:
rolling_mean = temperature.rolling(window=3).mean()
rolling_mean

0          NaN
1          NaN
2    21.333333
3    22.000000
4    24.000000
5    27.333333
6    28.333333
7    26.666667
8    24.666667
9    24.000000
dtype: float64

Filter out temperatures that are within one standard deviation of the mean

In [40]:
std_dev = temperature.std()
std_dev

3.204163957519444

In [41]:
filtered_temps = temperature[(temperature > mean_temp - std_dev) & (temperature < mean_temp + std_dev)]
filtered_temps

0    23
3    25
4    27
7    22
8    24
9    26
dtype: int64

Merging DataFrames: Product Orders

Create the Orders DataFrame and Create the customers DataFrame

In [42]:
orders = pd.DataFrame({
    'OrderID': [1, 2, 3, 4, 5],
    'CustomerID': [101, 102, 103, 104, 101],
    'Product': ['A', 'B', 'A', 'C', 'B'],
    'Quantity': [2, 1, 4, 2, 3]
})
orders

   OrderID  CustomerID Product  Quantity
0        1         101       A         2
1        2         102       B         1
2        3         103       A         4
3        4         104       C         2
4        5         101       B         3

In [43]:
customers = pd.DataFrame({
    'CustomerID': [101, 102, 103, 104],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Location': ['New York', 'Los Angeles', 'Chicago', 'Houston']
})
customers

   CustomerID     Name     Location
0         101    Alice     New York
1         102      Bob  Los Angeles
2         103  Charlie      Chicago
3         104    David      Houston

Merge the orders and customers DataFrames on 'CustomerID'

In [44]:
merged_df = pd.merge(orders, customers, on='CustomerID')
merged_df

   OrderID  CustomerID Product  Quantity     Name     Location
0        1         101       A         2    Alice     New York
1        5         101       B         3    Alice     New York
2        2         102       B         1      Bob  Los Angeles
3        3         103       A         4  Charlie      Chicago
4        4         104       C         2    David      Houston

Group by 'Location' and calculate the total quantity of orders

In [45]:
quantity_by_location = merged_df.groupby('Location')['Quantity'].sum()
quantity_by_location

Location
Chicago        4
Houston        2
Los Angeles    1
New York       5
Name: Quantity, dtype: int64

Find the customer who placed the highest number of orders

In [46]:
orders_count = merged_df['CustomerID'].value_counts()
orders_count

CustomerID
101    2
102    1
103    1
104    1
Name: count, dtype: int64

In [47]:
highest_orders_customer_id = orders_count.idxmax()
highest_orders_customer_id

101

In [48]:
highest_orders_customer = customers[customers['CustomerID'] == highest_orders_customer_id]
highest_orders_customer

   CustomerID   Name  Location
0         101  Alice  New York

Add a new column 'Total_Quantity' which is the cumulative sum of quantities for each product

In [49]:
merged_df['Total_Quantity'] = merged_df.groupby('Product')['Quantity'].cumsum()
merged_df

   OrderID  CustomerID Product  Quantity     Name     Location  Total_Quantity
0        1         101       A         2    Alice     New York               2
1        5         101       B         3    Alice     New York               3
2        2         102       B         1      Bob  Los Angeles               4
3        3         103       A         4  Charlie      Chicago               6
4        4         104       C         2    David      Houston               2

Filter the merged DataFrame to show only the orders for products 'A' and 'B'

In [50]:
filtered_orders = merged_df[merged_df['Product'].isin(['A', 'B'])]
filtered_orders

   OrderID  CustomerID Product  Quantity     Name     Location  Total_Quantity
0        1         101       A         2    Alice     New York               2
1        5         101       B         3    Alice     New York               3
2        2         102       B         1      Bob  Los Angeles               4
3        3         103       A         4  Charlie      Chicago               6